Autodesk.Revit.UI.UIFabricationUtils.ServiceSwapOutPartTypeMouseOver(Autodesk.Revit.DB.Document,System.Int32)
Sets the required information to select the part types in the model from the moused-over fittings.
document:
The document.
partTypeId:
The part type Id. Pass -1 to select none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.RouteAndFillPartBrowserOnPartTypeChanged(Autodesk.Revit.DB.Document,System.Int32,System.Int32,System.Int32)
The fabrication route and fill part types are changed from the fabrication part browser, so the available solutions are needed to updated.
doc:
The document.
requiredTypeId:
The fabrication part type id that must be included in the route and fill solutions.If the id is invalid, it will be ignored.
optionalTypeId:
The fabrication part type id that may or mat not be included from the route and fill solutions. If the id is invalid, will be ignored.
selectedTypeId:
The fabrication part type id that is currently selected in the Fabrication Part Browser.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016